# SetSlabHeight

## Description
Sets the height of a slab.

```pascal
PROCEDURE SetSlabHeight(
				slab   : HANDLE;
				height : REAL (Coordinate));
```

```python

def vs.SetSlabHeight(slab, height):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|slab|HANDLE|The slab.|
|height|REAL (Coordinate)|The height of the slab.|

## See Also
VS Functions:
GetSlabHeight

## Version
Availability: from Vectorworks 2011
## Category
* Objects - Architectural